app/controllers/indox_controller.rb

SELECT "conversations".* FROM "conversations"
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def index
    @conversations = Conversation.all
    @conversation = Conversation.find(params[:id]) if params[:id]